In [1]:
import sqlite3

# General variables 
DATA_PATH = './../../../data/sqlite_data/'

db_path = DATA_PATH + 'poc.db'

In [2]:
sql_command = """CREATE TABLE IF NOT EXISTS users_poc (
    usr_id CHAR(64) PRIMARY KEY, -- 64 Chars: keccak_256
    name VARCHAR(25),
    email VARCHAR(30) UNIQUE,
    company_id CHAR(64),
    FOREIGN KEY (company_id)
        REFERENCES companies_poc (company_id)
        ON UPDATE SET NULL
        ON DELETE SET NULL
);"""

In [3]:
# Pray to GOD if this is in Prod, or simply check the command 1000 times xD
db_connection = sqlite3.connect(db_path)
cursor = db_connection.cursor()

cursor.execute("DROP TABLE IF EXISTS users_poc")
cursor.execute(sql_command)

db_connection.commit() 
db_connection.close()

Inserting into table

In [4]:
import secrets

def getIDKey():
    return secrets.token_hex(nbytes=32)

In [5]:
# values
id1= getIDKey()
name1 = "Adolf"
email1 = "adolf@gmail.com"

id2= getIDKey()
name2 = "Adolf2"
email2 = "adolf2@gmail.com"

id3= getIDKey()
name3 = "Victoria"
email3 = "vic@gmail.com"

sql_command ='INSERT OR IGNORE INTO users_poc (usr_id, name, email) VALUES (?,?,?)'

In [6]:
db_connection = sqlite3.connect(db_path, timeout=10)
cursor = db_connection.cursor()

cursor.execute(sql_command, (id1, name1, email1))
cursor.execute(sql_command, (id2, name2, email2))
cursor.execute(sql_command, (id3, name3, email3))

# Yep, close the Fu... DB
db_connection.commit()  # Commit to finalize the changes
db_connection.close()

Show Data

In [7]:
import pandas as pd

def showData(name="users_poc", columns=['USR_ID','NAME','EMAIL', 'COMPANY_ID'], key='USR_ID'):
    db_connection = sqlite3.connect(db_path)
    cursor = db_connection.cursor()

    cursor.execute("SELECT * FROM "+name)
    data = cursor.fetchall()

    # Yep, close the Fu... DB
    db_connection.commit()  # Commit to finalize the changes
    db_connection.close()

    return pd.DataFrame(data, columns=columns).set_index(key)

showData()

,NAME,EMAIL,COMPANY_ID
USR_ID,,,
4483a326609bc74d59472f8b334ae56cb0e40ba65b49d095bb76a7385ae64829,Adolf,adolf@gmail.com,None
73afaf818eebb6fa96b124dd6077d20b0505440e63d755d107541a0a41c4d71c,Adolf2,adolf2@gmail.com,None
69f4e6012a4025ac4cc819cf84533101dfc6972cfe99c3a3773316bb70bf51db,Victoria,vic@gmail.com,None

Update value

In [8]:
db_connection = sqlite3.connect(db_path)
cursor = db_connection.cursor()

cursor.execute("UPDATE OR IGNORE users_poc SET name='Jenny', email='jenny@gmail.com' WHERE name='Adolf2'")

# Yep, close the Fu... DB
db_connection.commit()  # Commit to finalize the changes
db_connection.close()

showData()

,NAME,EMAIL,COMPANY_ID
USR_ID,,,
4483a326609bc74d59472f8b334ae56cb0e40ba65b49d095bb76a7385ae64829,Adolf,adolf@gmail.com,None
73afaf818eebb6fa96b124dd6077d20b0505440e63d755d107541a0a41c4d71c,Jenny,jenny@gmail.com,None
69f4e6012a4025ac4cc819cf84533101dfc6972cfe99c3a3773316bb70bf51db,Victoria,vic@gmail.com,None

In [9]:
def updateUserCompanyID(email="adolf@gmail.com", com_id="4fab9708e1eaeb28d6e096227f2ea99d30c20346be3e9fba98a8492943ec8fd5"):
    db_connection = sqlite3.connect(db_path)
    cursor = db_connection.cursor()

    cursor.execute("UPDATE OR IGNORE users_poc SET company_id='"+com_id+"' WHERE email='"+email+"'")

    # Yep, close the Fu... DB
    db_connection.commit()  # Commit to finalize the changes
    db_connection.close()

    return showData()

Drop table

In [10]:
def dropTable():
    db_connection = sqlite3.connect(db_path)
    cursor = db_connection.cursor()

    cursor.execute("DROP TABLE users_poc")

    # Yep, close the Fu... DB
    db_connection.commit()  # Commit to finalize the changes
    db_connection.close()

# dropTable()

Creatin  a company DB

In [11]:
sql_command = """CREATE TABLE IF NOT EXISTS companies_poc (
    company_id CHAR(64) PRIMARY KEY, -- 64 Chars: keccak_256
    name VARCHAR(25),
    email VARCHAR(30) UNIQUE
);"""

db_connection = sqlite3.connect(db_path)
cursor = db_connection.cursor()

cursor.execute("DROP TABLE IF EXISTS companies_poc")
cursor.execute(sql_command)
cursor.execute('INSERT OR IGNORE INTO companies_poc (company_id, name, email) VALUES ("4fab9708e1eaeb28d6e096227f2ea99d30c20346be3e9fba98a8492943ec8fd5", "Grifenix", "hello@grifenix.com")')
cursor.execute('INSERT OR IGNORE INTO companies_poc (company_id, name, email) VALUES ("666b9708e1eaeb28d6e096227f2ea99d30c20346be3e9fba98a8492943ec8666", "Essenfy", "hello@essenfy.com")')

# Yep, close the Fu... DB
db_connection.commit()  # Commit to finalize the changes
db_connection.close()

showData("companies_poc", columns=["company_id", "name", "email"], key='company_id')

,name,email
company_id,,
4fab9708e1eaeb28d6e096227f2ea99d30c20346be3e9fba98a8492943ec8fd5,Grifenix,hello@grifenix.com
666b9708e1eaeb28d6e096227f2ea99d30c20346be3e9fba98a8492943ec8666,Essenfy,hello@essenfy.com

In [12]:
# Adding foreign keys
updateUserCompanyID() # Adolf to Grifenix
updateUserCompanyID('vic@gmail.com','666b9708e1eaeb28d6e096227f2ea99d30c20346be3e9fba98a8492943ec8666') # Victoria to Essenfy
updateUserCompanyID('jenny@gmail.com','666b9708e1eaeb28d6e096227f2ea99d30c20346be3e9fba98a8492943ec8666') # Victoria to Essenfy

,NAME,EMAIL,COMPANY_ID
USR_ID,,,
4483a326609bc74d59472f8b334ae56cb0e40ba65b49d095bb76a7385ae64829,Adolf,adolf@gmail.com,4fab9708e1eaeb28d6e096227f2ea99d30c20346be3e9f...
73afaf818eebb6fa96b124dd6077d20b0505440e63d755d107541a0a41c4d71c,Jenny,jenny@gmail.com,666b9708e1eaeb28d6e096227f2ea99d30c20346be3e9f...
69f4e6012a4025ac4cc819cf84533101dfc6972cfe99c3a3773316bb70bf51db,Victoria,vic@gmail.com,666b9708e1eaeb28d6e096227f2ea99d30c20346be3e9f...

Joining tables data

In [13]:
def executeSQL(sql_command="SELECT * FROM users_poc", columns=None, key=None):
    db_connection = sqlite3.connect(db_path)
    cursor = db_connection.cursor()

    cursor.execute(sql_command)
    data = cursor.fetchall()
    
    # Yep, close the Fu... DB
    db_connection.commit()  # Commit to finalize the changes
    db_connection.close()

    table = pd.DataFrame(data, columns=columns)
    return table.set_index(columns[0]) if columns else table

executeSQL("SELECT * FROM companies_poc")

,0,1,2
0,4fab9708e1eaeb28d6e096227f2ea99d30c20346be3e9f...,Grifenix,hello@grifenix.com
1,666b9708e1eaeb28d6e096227f2ea99d30c20346be3e9f...,Essenfy,hello@essenfy.com

In [14]:
executeSQL("SELECT * FROM users_poc")

,0,1,2,3
0,4483a326609bc74d59472f8b334ae56cb0e40ba65b49d0...,Adolf,adolf@gmail.com,4fab9708e1eaeb28d6e096227f2ea99d30c20346be3e9f...
1,73afaf818eebb6fa96b124dd6077d20b0505440e63d755...,Jenny,jenny@gmail.com,666b9708e1eaeb28d6e096227f2ea99d30c20346be3e9f...
2,69f4e6012a4025ac4cc819cf84533101dfc6972cfe99c3...,Victoria,vic@gmail.com,666b9708e1eaeb28d6e096227f2ea99d30c20346be3e9f...

In [15]:
executeSQL("""
    SELECT 
        companies_poc.company_id, companies_poc.name, companies_poc.email, users_poc.name, users_poc.email
    FROM companies_poc 
    INNER JOIN users_poc 
    ON companies_poc.company_id = users_poc.company_id
""", columns=['CompanyID', 'Company', 'C.Email', 'Name', 'Email'])

,Company,C.Email,Name,Email
CompanyID,,,,
4fab9708e1eaeb28d6e096227f2ea99d30c20346be3e9fba98a8492943ec8fd5,Grifenix,hello@grifenix.com,Adolf,adolf@gmail.com
666b9708e1eaeb28d6e096227f2ea99d30c20346be3e9fba98a8492943ec8666,Essenfy,hello@essenfy.com,Jenny,jenny@gmail.com
666b9708e1eaeb28d6e096227f2ea99d30c20346be3e9fba98a8492943ec8666,Essenfy,hello@essenfy.com,Victoria,vic@gmail.com

GROUP BY

In [18]:
def groupByExample(join="INNER"):
    #"""
    #     SELECT 
    #         companies_poc.company_id, companies_poc.name, companies_poc.email, COUNT(users_poc.email), users_poc.name 
    #     FROM companies_poc 
    #     <join> JOIN users_poc 
    #     ON companies_poc.company_id = users_poc.company_id
    #     GROUP BY companies_poc.company_id, companies_poc.name
    # """
    sql_command = """
        SELECT 
            companies_poc.company_id, companies_poc.name, companies_poc.email, COUNT(users_poc.email), users_poc.name 
        FROM companies_poc
    """

    sql_command += (join + """ JOIN users_poc 
        ON companies_poc.company_id = users_poc.company_id
        GROUP BY companies_poc.company_id, companies_poc.name
    """)
    return executeSQL(sql_command, columns=['CompanyID', 'Company', 'C.Email', 'USERS', 'Name'])

groupByExample()

,0,1,2,3,4
0,4fab9708e1eaeb28d6e096227f2ea99d30c20346be3e9f...,Grifenix,hello@grifenix.com,1,Adolf
1,666b9708e1eaeb28d6e096227f2ea99d30c20346be3e9f...,Essenfy,hello@essenfy.com,2,Jenny

In [20]:
# Full join (Outer Join)
executeSQL('INSERT OR IGNORE INTO companies_poc (company_id, name, email) VALUES ("000b9708e1eaeb28d6e096227f2ea99d30c20346be3e9fba98a8492943ec8666", "Alchemy", "hello@alchemy.com")')
groupByExample(join='FULL')

,0,1,2,3,4
0,000b9708e1eaeb28d6e096227f2ea99d30c20346be3e9f...,Alchemy,hello@alchemy.com,0,None
1,4fab9708e1eaeb28d6e096227f2ea99d30c20346be3e9f...,Grifenix,hello@grifenix.com,1,Adolf
2,666b9708e1eaeb28d6e096227f2ea99d30c20346be3e9f...,Essenfy,hello@essenfy.com,2,Jenny